Revit 2024 API
BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecifiedError Property
 Major direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarSystemDirectionNotSpecifiedError { get; }
Visual Basic
Public Shared ReadOnly Property RebarSystemDirectionNotSpecifiedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarSystemDirectionNotSpecifiedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace